import ubinascii
from machine import unique_id
from machine import Pin, unique_id

# =========================================================
#  デバイスID関係初期化
# =========================================================
RAW_UID = unique_id()  # 例: b"\x01\xAF\x03..."
DEVICE_ID = ubinascii.hexlify(RAW_UID).decode().upper()

# =========================================================
#  ファイル関連変数初期化
# =========================================================
SEED_FILE = "master.seed"
PROFILE_FILE = "profile.json"
FW_VERSION     = "1.7.0-OTP-Auth-LOCKDOWN"
HMAC_KEY_FILE  = "hsm_hmac.key"
KEYPART_FILE   = "hsm_keypart.key"
seedpath="master.seed"

# =========================================================
#  ロックダウン関係初期化
# =========================================================
fail_count = 0
LOCK_TIME = 180
lock_until = 0

# =========================================================
#  OTP変数初期化
# =========================================================
CURRENT_OTP = None

# =========================================================
#  秘密鍵初期化
# =========================================================
SECRET_HMAC_KEY    = None
SECRET_AES_KEYPART = None

# =========================================================
#  LED 初期化
# =========================================================
LED = Pin(25, Pin.OUT)
LED.value(0)